IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_ESM_TOP_ESM.xml
<module name="TOP_ESM_TOP_ESM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="TOP_ESM_PID" acronym="TOP_ESM_PID" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID register scheme" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business Unit: 10 = Processors" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x4064" description="Module ID" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x9" description="RTL revision. Will vary depending on release." range="15 - 11" rwaccess="RO"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x0" description="Minor revision" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_ESM_INFO" acronym="TOP_ESM_INFO" offset="0x4" width="32" description="">
		<bitfield id="LAST_RESET" width="1" begin="31" end="31" resetval="0x0" description="Indicates the Source of the last Reset" range="31" rwaccess="RO"/> 
		<bitfield id="PULSE_GROUPS" width="8" begin="15" end="8" resetval="0x1" description="Number of Pulse Error Groups" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="GROUPS" width="8" begin="7" end="0" resetval="0x3" description="Total number of Error Groups" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_ESM_EN" acronym="TOP_ESM_EN" offset="0x8" width="8" description="">
		<bitfield id="KEY" width="4" begin="3" end="0" resetval="0x0" description="Global Enable" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_ESM_SFT_RST" acronym="TOP_ESM_SFT_RST" offset="0xC" width="8" description="">
		<bitfield id="KEY" width="4" begin="3" end="0" resetval="0x0" description="Global Soft Reset" range="3 - 0" rwaccess="WO"/>
	</register>
	<register id="TOP_ESM_ERR_RAW" acronym="TOP_ESM_ERR_RAW" offset="0x10" width="8" description="">
		<bitfield id="STS" width="3" begin="2" end="0" resetval="0x0" description="This is the raw status for config errors" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_ESM_ERR_STS" acronym="TOP_ESM_ERR_STS" offset="0x14" width="8" description="">
		<bitfield id="MSK" width="3" begin="2" end="0" resetval="0x0" description="This is the masked status/clear for config errors" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_ESM_ERR_EN_SET" acronym="TOP_ESM_ERR_EN_SET" offset="0x18" width="8" description="">
		<bitfield id="MSK" width="3" begin="2" end="0" resetval="0x0" description="This is the mask enable set for config errors" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_ESM_ERR_EN_CLR" acronym="TOP_ESM_ERR_EN_CLR" offset="0x1C" width="8" description="">
		<bitfield id="MSK" width="3" begin="2" end="0" resetval="0x0" description="This is the mask enable clear for config errors" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_ESM_LOW_PRI" acronym="TOP_ESM_LOW_PRI" offset="0x20" width="32" description="">
		<bitfield id="PLS" width="16" begin="31" end="16" resetval="0x65535" description="This is the highest priority outstanding low priority pulse interrupt" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="LVL" width="16" begin="15" end="0" resetval="0x65535" description="This is the highest priority outstanding low priority level interrupt" range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_ESM_HI_PRI" acronym="TOP_ESM_HI_PRI" offset="0x24" width="32" description="">
		<bitfield id="PLS" width="16" begin="31" end="16" resetval="0x65535" description="This is the highest priority outstanding high priority pulse interrupt" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="LVL" width="16" begin="15" end="0" resetval="0x65535" description="This is the highest priority outstanding high priority level interrupt" range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_ESM_LOW" acronym="TOP_ESM_LOW" offset="0x28" width="32" description="">
		<bitfield id="STS" width="32" begin="31" end="0" resetval="0x0" description="This is the raw status for config errors" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_ESM_HI" acronym="TOP_ESM_HI" offset="0x2C" width="32" description="">
		<bitfield id="STS" width="32" begin="31" end="0" resetval="0x0" description="This is the raw status for config errors" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_ESM_EOI" acronym="TOP_ESM_EOI" offset="0x30" width="16" description="">
		<bitfield id="KEY" width="11" begin="10" end="0" resetval="0x0" description="This is the interrupt being serviced" range="10 - 0" rwaccess="WO"/>
	</register>
	<register id="TOP_ESM_PIN_CTRL" acronym="TOP_ESM_PIN_CTRL" offset="0x40" width="8" description="">
		<bitfield id="PWM_EN" width="4" begin="7" end="4" resetval="0x0" description="PWM enable" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="KEY" width="4" begin="3" end="0" resetval="0x0" description="Pin Control Key" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_ESM_PIN_STS" acronym="TOP_ESM_PIN_STS" offset="0x44" width="0" description="">
		<bitfield id="VAL" width="1" begin="0" end="0" resetval="0x0" description="Value of the error_pin_n" range="0" rwaccess="RO"/>
	</register>
	<register id="TOP_ESM_PIN_CNTR" acronym="TOP_ESM_PIN_CNTR" offset="0x48" width="24" description="">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="Current Counter Value" range="23 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_ESM_PIN_CNTR_PRE" acronym="TOP_ESM_PIN_CNTR_PRE" offset="0x4C" width="24" description="">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="Counter Pre-Load Value" range="23 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_ESM_PWMH_PIN_CNTR" acronym="TOP_ESM_PWMH_PIN_CNTR" offset="0x50" width="24" description="">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="Current Counter Value" range="23 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_ESM_PWMH_PIN_CNTR_PRE" acronym="TOP_ESM_PWMH_PIN_CNTR_PRE" offset="0x54" width="24" description="">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="Counter Pre-Load Value" range="23 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_ESM_PWML_PIN_CNTR" acronym="TOP_ESM_PWML_PIN_CNTR" offset="0x58" width="24" description="">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="Current Counter Value" range="23 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_ESM_PWML_PIN_CNTR_PRE" acronym="TOP_ESM_PWML_PIN_CNTR_PRE" offset="0x5C" width="24" description="">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="Counter Pre-Load Value" range="23 - 0" rwaccess="RW"/>
	</register>
</module>